cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 50;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 45;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 50;
        value           uniform 50;
    }
    heatedWall
    {
        type            fixedGradient;
        gradient        uniform 33859.0;
    }
    adiabaticWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
