cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.58 0 0);
boundaryField
{
    inlet          { type flowRateInletVelocity; massFlowRate 3.1395e-4; rho rho; value uniform (0.58 0 0); }
    outlet         { type pressureInletOutletVelocity; value uniform (0.58 0 0); }
    heatedWall     { type noSlip; }
    adiabaticWalls { type noSlip; }
}
