cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    inlet          { type calculated; value uniform 101325; }
    outlet         { type calculated; value uniform 101325; }
    heatedWall     { type calculated; value uniform 101325; }
    adiabaticWalls { type calculated; value uniform 101325; }
}
