cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    inlet          { type fixedFluxPressure; value uniform 101325; }
    outlet         { type fixedValue;        value uniform 101325; }
    heatedWall     { type fixedFluxPressure; value uniform 101325; }
    adiabaticWalls { type fixedFluxPressure; value uniform 101325; }
}
