cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType laminar;
