cold_plate_HX/Buoyancy_50K_Microchannel_Re2300/system/metricConstants
CASE_NAME=Buoyancy_50K_Microchannel_Re2300
FLUID_NAME="He_50K"
Lflow=0.3
Dh=0.01
Acs=0.0005
Aheated=0.015
Qwall_W=9.4
k_W_mK=0.01850769
rho_kg_m3=1.0
cp_J_kgK=5193
mu_Pa_s=2.73e-6
nu_m2_s=2.66e-6
beta_1_K=0.02
Pr=0.766
TRef_K=50
CarnotCOP=0.20
COMPRESSIBLE=1
Tin_K=45
MOLWT_kg_mol=4.0026e-3
Rgas_J_molK=8.314
